# OpacityByClass

## Description
Sets the document default settings to the opacity of the active class.

```pascal
PROCEDURE OpacityByClass;
```

```python
def vs.OpacityByClass():
    return None
```

## Remarks
Sets the global attributes to use the opacity of the default class.

## Version
Availability: from VectorWorks13.0

## Category
* Classes